---
kind: property
id: P:Autodesk.Revit.DB.Element.WorksetId
zh: 构件、图元、元素
source: html/4b45250a-7a07-a89a-0f63-cf8d142a7b93.htm
---
# Autodesk.Revit.DB.Element.WorksetId Property

**中文**: 构件、图元、元素

Get Id of the Workset which owns the element.

## Syntax (C#)
```csharp
public WorksetId WorksetId { get; }
```

## Remarks
Each element belongs to one and only one workset.